In [4]:
import numpy as np
import pandas as pd
a=np.array([0,1,2,3,4,5])

### 一、数组间的计算--数据自动对齐，

### 1.1 加减乘除计算
### 即索引相同的进行计算，否则为NaN

In [5]:
a=pd.Series([1,2,3,4,5],index=list('abdfg'))
a

a    1
b    2
d    3
f    4
g    5
dtype: int64

In [6]:
b=pd.Series([1,2,3,4,5],index=list('agdfx'))
b

a    1
g    2
d    3
f    4
x    5
dtype: int64

In [7]:
a+b

a    2.0
b    NaN
d    6.0
f    8.0
g    7.0
x    NaN
dtype: float64

In [8]:
c=pd.DataFrame(np.arange(6).reshape(2,3),index=list('ab'),columns=list('ABC'))
c

   A  B  C
a  0  1  2
b  3  4  5

In [9]:
d=pd.DataFrame(np.arange(12).reshape(3,4),index=list('bca'),columns=list('ACBD'))
d

   A  C   B   D
b  0  1   2   3
c  4  5   6   7
a  8  9  10  11

In [10]:
c+d

     A     B     C   D
a  8.0  11.0  11.0 NaN
b  3.0   6.0   6.0 NaN
c  NaN   NaN   NaN NaN

In [12]:
e=c.sub(d,fill_value=0) 
e

     A    B    C     D
a -8.0 -9.0 -7.0 -11.0
b  3.0  2.0  4.0  -3.0
c -4.0 -6.0 -5.0  -7.0

### 1.2 取绝对值
### 利用numpy中的abs（）方法取绝对值，，power（df，n）求df的n次方

In [13]:
np.abs(e)

     A    B    C     D
a  8.0  9.0  7.0  11.0
b  3.0  2.0  4.0   3.0
c  4.0  6.0  5.0   7.0

In [14]:
np.power(e,2)  #求平方

      A     B     C      D
a  64.0  81.0  49.0  121.0
b   9.0   4.0  16.0    9.0
c  16.0  36.0  25.0   49.0

In [15]:
np.power(e,3)  #求立方

       A      B      C       D
a -512.0 -729.0 -343.0 -1331.0
b   27.0    8.0   64.0   -27.0
c  -64.0 -216.0 -125.0  -343.0

In [16]:
e

     A    B    C     D
a -8.0 -9.0 -7.0 -11.0
b  3.0  2.0  4.0  -3.0
c -4.0 -6.0 -5.0  -7.0

In [48]:
e.min(axis=1)   #列方向上的最小值

a   -11.0
b    -3.0
c    -7.0
dtype: float64

In [18]:
e.max()  #默认为行方向即：axis=0上的统计

A    3.0
B    2.0
C    4.0
D   -3.0
dtype: float64

### 1.3 自定义一些函数可以快速进行格式化的设置

In [19]:
def f(x):   #找到最大值和最小值
    return pd.Series([x.min(),x.max()],index=('min','max'))
e.apply(f)

       A    B    C     D
min -8.0 -9.0 -7.0 -11.0
max  3.0  2.0  4.0  -3.0

In [20]:
def f(x):  #保留两位小数
    return '%.2f'% x
e.applymap(f)

       A      B      C       D
a  -8.00  -9.00  -7.00  -11.00
b   3.00   2.00   4.00   -3.00
c  -4.00  -6.00  -5.00   -7.00

### 1.4 排序的问题

In [21]:
e

     A    B    C     D
a -8.0 -9.0 -7.0 -11.0
b  3.0  2.0  4.0  -3.0
c -4.0 -6.0 -5.0  -7.0

In [22]:
f=e.sort_values(by='C')
f

     A    B    C     D
a -8.0 -9.0 -7.0 -11.0
c -4.0 -6.0 -5.0  -7.0
b  3.0  2.0  4.0  -3.0

In [23]:
f.sort_index(axis=1)

     A    B    C     D
a -8.0 -9.0 -7.0 -11.0
c -4.0 -6.0 -5.0  -7.0
b  3.0  2.0  4.0  -3.0

In [24]:
d=pd.DataFrame(np.arange(12).reshape(3,4),index=list('bca'),columns=list('ACBD'))
d

   A  C   B   D
b  0  1   2   3
c  4  5   6   7
a  8  9  10  11

In [25]:
d.sort_index(axis=1)  #将  ACBD  变成  ABCD

   A   B  C   D
b  0   2  1   3
c  4   6  5   7
a  8  10  9  11

In [26]:
  d.sort_index()  #将 b c a  变 成   a  b c

   A  C   B   D
a  8  9  10  11
b  0  1   2   3
c  4  5   6   7

In [37]:
d.sort_index(axis=1).sort_index()

   A   B  C   D
a  8  10  9  11
b  0   2  1   3
c  4   6  5   7

In [40]:
t=pd.DataFrame(np.random.randint(1,100,12).reshape(3,4),index=list('acb'),columns=list('ACDB'))
t

    A   C   D   B
a  35  66  98   2
c  16  10  50  48
b  80  21  15   6

In [45]:
t.sort_values(by='C')

    A   C   D   B
c  16  10  50  48
b  80  21  15   6
a  35  66  98   2

### 1.5 排名问题---rank（）

In [47]:
t

    A   C   D   B
a  35  66  98   2
c  16  10  50  48
b  80  21  15   6

In [46]:
t.rank()

     A    C    D    B
a  2.0  3.0  3.0  1.0
c  1.0  1.0  2.0  3.0
b  3.0  2.0  1.0  2.0

### 二、数组内的计算

In [31]:
b=a**2
b1=np.array([a,b])
b1

array([[ 1,  2,  3,  4,  5],
       [ 1,  4,  9, 16, 25]], dtype=int64)

In [33]:
t=pd.DataFrame(b1,columns=list('abcde'))
t

   a  b  c   d   e
0  1  2  3   4   5
1  1  4  9  16  25

In [34]:
t1=pd.DataFrame(b1.T,columns=list('ab'))
t1

   a   b
0  1   1
1  2   4
2  3   9
3  4  16
4  5  25

### 1、计算a列和b列的协方差

In [ ]:
t1['a'].cov(t1['b'])    #求协方差

In [ ]:
t1.cov()  #求方差和协方差

### 2、计算a列和b列的相关系数

In [ ]:
t1['a'].corr(t1['b'])

In [ ]:
t1.corr()